

// პირველ სამ სავარჯიშოში ფუნქციისთვის გადასაცემ მასივად გამოიყენეთ ჩემს მიერ დაწერილი მასივი data.

// problem 1
// დაწერეთ ფუნქცია რომელიც პარამეტრად მიცემული მაისივიდან დააბრუნებს მომხმარებლების საშუალო ასაკს.

// problem 2
// დაწერეთ ფუნქცია რომელიც დააბრუნებს მასივს სადაც იქნება მხოლოდ მომხმარებლების Email.

// problem 3
// დაწერეთ ფუნქცია რომელიც დააბრუნებს რამდენი ქალი და რამდენი კაცია გადაცემულ მასივში.

// problem 4
// დაწერეთ ფუნქცია რომელსაც პარამეტრად გადავაწოდებთ მასივს და მასივში მოსაძებნ ელემენტს.
// ფუნქციამ უნდა დააბრუნოს ელემენტის ინდექსი მასივში.
// მაგალითად

// let names = ["John", "Jane", "Gio", "Sopo", "luka", "Eka", "Nino"];
// function findElementsIndex(array, element) {}

// findElementsIndex(names, "Gio"); // უნდა დააბრუნოს ინდექსი 2
// findElementsIndex(names, "Eka"); // უნდა დააბრუნოს ინდექსი 5

// problem 5

// დაწერეთ ფუნქცია რომელსაც გადავაწოდებთ 3 პარამეტრს.
// 2 მასივს და 1 ელემენტს.
// თუ ეს ელემენტი ორივე მასივში მოიძებნება დავაბრუნებთ სტრინგს სადაც ეწერება
// რომ ელემენტი ორივე მასივში მოიძებნა.
// თუ მხოლოდ ერთერთ მასივში იქნება დავაბრუნებთ რომელ მასივში მოიძებნა (მაგ: პირველ მასივში გვაქვს ეს ელემენტი ან მეორე მასივში გვაქვს ეს ელემენტი)
// თუ არცერთში არ იყო დავაბრუნებთ რომ არცერთ მასივში არ გვაქვს მსგავსი ელემენტი.

//მაგალითად

// let array1 = [2, 4, 8, 10, 24, 46, 90, 54, 12];
// let array2 = [12, 44, 81, 10, 243, 46, 90, 154, 12];

// function findElement(arr1, arr2, element) {}

// findElement(array1, array2, 10); // უნდა დაბრუნოს რომ ორივე მასივში არის ელემენტი
// findElement(array1, array2, 2); // უნდა დაბრუნოს რომ პირველ მასივში არის ელემენტი
// findElement(array1, array2, 243); // უნდა დაბრუნოს რომ მეორე მასივში არის ელემენტი

// have fun :)
