

// დავალებების შესასრულებლად გამოიყენეთ ბოლო ლექციაზე ნასწავლი მეთოდები.

// problem 1
// დაწერეთ ფუნქცია რომელიც პარამეტრად მიცემული მაისივიდან დააბრუნებს მომხმარებლების საშუალო ასაკს.
// problem 2
// დაწერეთ ფუნქცია რომელიც პარამეტრად მიღებული მაისივიდან დააბრუნებს ახალ მასივს
// სადაც იქნება მომხმარებლები რომლებიც არ არიან 20 წელზე მეტის.

// problem 3
// დაწერეთ ფუნქცია რომელიც დააბრუნებს მასივს სადაც იქნება მხოლოდ მომხმარებლების სახელი და გვარი.

// problem 4
// დაწერეთ ფუნქცია რომელიც დააბრუნებს რამდენი ქალი და რამდენი კაცია გადაცემულ მასივში.

// problem 5
// დაწერეთ ფუნქცია რომელიც დააბრუნებს პირველ მომხმარებელს რომელის ასაკიც 40 წელზე მეტია.

// problem6
// დაწერეთ ფუნქცია რომელსაც გადავცემთ 2 პარამეტრს. მასივს და ელემენტს რომლის წაშლაც გვინდა მასივიდან
// თუ მოცემული ელემენტი იქნება გადაცემულ მასივში მაშინ დავაბრუნებთ ახალ მასივს სადაც უკვე ამოშლილი იქნება გადაცემული პარამეტრი

// problem7
// დაწერეთ ფუნქცია რომელიც დაადგენს პარამეტრად გადაცემული სტრინგი არის თუ არა პალინდრომი

// პალინდრომი არის სიტყვა რომელიც მარცხნიდან და მარჯვნიდან ერთნაირად იკითხება
// მაგალითად:  kayak, deified, rotator, repaper, deed, peep, wow, noon
